In [5]:
# Import required libraries
import sqlite3
import pandas as pd

# Connect to SQLite database
conn = sqlite3.connect(r"./db/vivino.db")

# Load CSV data into Pandas DataFrame
# sales_data = pd.read_csv("./db/vivino.db")
# Write the data to a sqlite table
# sales_data.to_sql("vivino", conn, if_exists="replace", index=False)

# Create a cursor object
cur = conn.cursor()

In [7]:
cur.execute("""
            SELECT * 
            FROM countries
            LIMIT 5;
            """)
cur.fetchall()

[('it', 'Italie', 563, 4270717, 274658, 42399),
 ('fr', 'France', 1306, 5973301, 422503, 67553),
 ('us', 'États-Unis', 362, 12273684, 204060, 28145),
 ('es', 'Espagne', 152, 2264396, 102662, 18026),
 ('pt', 'Portugal', 93, 1123535, 39847, 5834)]

In [8]:
query = """
            SELECT * 
            FROM countries
            LIMIT 5;
            """
sales_df = pd.read_sql_query(query, conn)
sales_df.head()

  code        name  regions_count  users_count  wines_count  wineries_count
0   it      Italie            563      4270717       274658           42399
1   fr      France           1306      5973301       422503           67553
2   us  États-Unis            362     12273684       204060           28145
3   es     Espagne            152      2264396       102662           18026
4   pt    Portugal             93      1123535        39847            5834